package ru.vavtech.model.enums;

import java.util.List;

public interface NumberConstants {
    /** Письменное представление разрядов числа */
    List<String> RANKS = List.of("", "тысяч", "миллион", "миллиард", "триллион");

    /** Окончания различных разрядов числа */
    List<List<String>> RANKS_ENDINGS = List.of(
            List.of("на ", "е ", ""),
            List.of("а ", "и ", " "),
            List.of(" ", "а ", "ов ") //миллион и выше
    );

    /** Целые, десятки и тысячи */
    List<List<String>> PRIME_NUMBERS_DOZENS_AND_HUNDREDS = List.of(
            List.of("", "од", "дв", "три ", "четыре ", "пять ", "шесть ", "семь ", "восемь ", "девять "),
            List.of("", "десять ", "двадцать ", "тридцать ", "сорок ", "пятьдесят ", "шестьдесят ", "семьдесят ", "восемьдесят ", "девяносто "),
            List.of("", "сто ", "двести ", "триста ", "четыреста ", "пятьсот ", "шестьсот ", "семьсот ", "восемьсот ", "девятьсот ")
    );

    /** Числа от одиннадцати до девятнадцати */
    List<String> PRIME_FROM_11_TO_19 = List.of("", "одиннадцать ", "двенадцать ", "тринадцать ",
            "четырнадцать ", "пятнадцать ", "шестнадцать ", "семнадцать ", "восемнадцать ", "девятнадцать ");

    /** Ноль */
    String ZERO = " ноль";
}
